<?php
/*** +------------------------------------------------------------------------------
  * index.php    	
  * +------------------------------------------------------------------------------
  * @package    	Index
  * @author    	 Anyon <Anyon@139.com>
  * @version    	$Id: index.php 2013-4-20 21:47:34 Anyon $
  * +------------------------------------------------------------------------------*/
  
    define('APP_NAME','Home'); //应用名
    define('TPL_STYLE','Home'); //模板样式名
    define('APP_PATH','./Home');//应用目录
    require './Base/init.php';
