<?php

// +----------------------------------------------------------------------
// | WebAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2020 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://webadmin.thinkadmin.top
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | gitee 代码仓库：https://gitee.com/zoujingli/WebAdmin
// | github 代码仓库：https://github.com/zoujingli/WebAdmin
// +----------------------------------------------------------------------

return [
    // 应用调试模式
    'app_debug'          => true,
    // 应用默认模块名称
    'default_module'     => 'index',
    // 应用默认控制器名称
    'default_controller' => 'Index',
    // 应用默认访问方法
    'default_action'     => 'index',
    // 应用默认时区
    'default_timezone'   => 'Asia/Shanghai',
];