<?php

// +----------------------------------------------------------------------
// | CxPHP 极速常驻内存框架 ~ 基于 WorkerMan 实现，极速及兼容并存
// +----------------------------------------------------------------------
// | 版权所有 2014~2020 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://www.cxphp.cn
// | 项目文档: http://doc.cxphp.cn
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | gitee 代码仓库：https://gitee.com/zoujingli/cxphp
// | github 代码仓库：https://github.com/zoujingli/cxphp
// +----------------------------------------------------------------------

return [
    // 默认日志记录通道
    'default' => 'file',
    // 日志通道列表
    'channel' => [
        'file' => [
            // 日志保存目录
            'file_path'   => '',
            // 日志日期格式
            'time_format' => 'Y-m-d H:i:s',
            // 日志文件数量
            'max_files'   => 10,
            // 独立日志级别
            'log_level'   => ['error', 'sql'],
            // 日志输出格式化
            'log_format'  => '[%s][%s] %s',
        ],
    ],
];